 #include<stdio.h>

//  & - 按（2进制）位与 
//  | - 按（2进制）位或
//  ^ - 按（2进制）位异或

int main()
{
	int a=3;   //0000 0000 0000 0000 0000 0000 0000 0011 (3的补码\原码)
	int b=-5;  //1000 0000 0000 0000 0000 0000 0000 0101(-5的原码)取反加1为补码 -->1111 1111 1111 1111 1111 1111 1111 1011
	int c=a & b;//位与--两个数对应的补码都为1就为1，有0就上0 ---->0000 0000 0000 0000 0000 0000 0000 0011(3的补码)
	int d=a | b;//位或--两个数对应的补码都为0就为0，有1就上1 ---->1111 1111 1111 1111 1111 1111 1111 1011(-5的补码)减1取反得原码
	int e=a ^ b;//位异或--两个数对应的补码相同为0，不同为1 ----> 1111 1111 1111 1111 1111 1111 1111 1000(-8的补码)…  
	printf("c=%d\n",c);
	printf("d=%d\n",d);
	
	
    //位异或-->1、R^R=0  2、0^R=R  3、R1^R2^R3=R1^R3^R2(结合律) 
    //可利用^进行无空变量转化 
    printf("交换前：a=%d b=%d\n",a,b);
    a =a^b;  //a=3^-5
    b =a^b;  //b=3^-5^-5 = 3^0 = 3
    a =a^b;  //a=3^-5^3 = 0^-5 = -5
    printf("交换后：a=%d b=%d\n",a,b);
	return 0;
 } 




 
