#include<stdio.h>
// ! 逻辑反操作
// - 负值 + 正值
// & 取地址 
// sizeof 操作数的类型长度(以字节为单位) 
// ~ 对一个数的二进制按位取反
// -- 前置、后置 ++ 前置、后置 
//* 间接访问操作符（解引用操作符）--指针 
// （类型） 强制类型转换 

int main()
{
	int a=3;   //0000 0000 0000 0000 0000 0000 0000 0011 
	printf("%p\n",&a);
	
	printf("%d\n",sizeof(a));  //计算a所占内存的大小，单位是字节 
	printf("%d\n",sizeof a);	//这样写也可以，同时证明sizeof不是函数是操作符，函数后的（）不可省 
	//	printf("%d\n",sizeof int);这样写是错的 
	
	printf("%d\n",~a); //1 111 1111 1111 1111 1111 1111 1111 1100负数补码—> 1 000 0000 0000 0000 0000 0000 0000 0100原码 
	
	int b=13;
	b |=(1<<4);
	printf("%d\n",b);
	
	
	b&=(~(1<<4));
	printf("%d\n",b);	 
	
	int c=3;
	int d=++c;   //前置++\--，先++\--，后使用  c=c+1 d=c
	int f=3;
	int e=f++;   //后置++\--，先使用，再++\--  e=f f=f+1
	printf("%d %d\n",d,c); 
	printf("%d %d\n",f,e); 
	
	int z=(int)3.14;
	printf("%d\n",z);
	
	return 0;
	
 } 
 
 //关系操作符
 //  >  >=  <  <=   !=  == 
 
