//正整数的原码、反码、补码相同 
//负整数的原码、反码、补码需要计算 
//整数在内存中存的是补码 

//   << 左移操作符（左边抛弃，右边补0） 
//   >>右移操作符 -- 1、逻辑位移 ：左边用0填充，右边丢弃  2、算数位移：左边用原该值的符号位填充，右边丢弃 
//   对于移位运算符，移动的是二进制位，不要移动负数位，这个是标准未定义的,并且只用于整数类型 
#include<stdio.h>
int main()
{
	int a=7; //0000 0000 0000 0000 0000 0000 0000 0111 -> 7的原码 
	        //1 000 0000 0000 0000 0000 0000 0000 0111 -> -7的原码(第一位变1)—> 1 111 1111 1111 1111 1111 1111 1111 1000 反码(原码数位不变，其他未按位取反) 
	        //1 111 1111 1111 1111 1111 1111 1111 1001 -> -7的补码(反码+1就是补码) 
	int b=a<<1; //7的原码最左边的0被移出去 ,最右边补上了个0 ——> 0000 0000 0000 0000 0000 0000 0000 1110
	printf("%d\n",b);
	
	int c=-7;  //1 111 1111 1111 1111 1111 1111 1111 1001 -> -7的补码
	int d=c<<2;//1111 1111 1111 1111 1111 1111 1111 0010(补码)-->减1取反，符号位不变--> 1 000 0000 0000 0000 0000 0000 0000 1110(原码) 
	printf("%d\n",d);
	//总结左移操作符和给数乘上2次方差不多 ，<<1就给乘上2的一次方，<<2就成上2的2次方 
	
	
//右移操作符分为算术移位和逻辑移位
    //1、逻辑位移 ：左边用0填充，右边丢弃  2、算数位移：左边用原该值的符号位填充，右边丢弃 
	int e=7;
	int f=e>>1;
	printf("%d\n",f);   //对于正整数来说看不出来是算数还是逻辑 
	
    
	int g=-7;  //1 111 1111 1111 1111 1111 1111 1111 1001 -> -7的补码
//若要是逻辑位移 0 111 1111 1111 1111 1111 1111 1111 1100 ->是正整数，补码原码都一样 
//若要是算数位移 1 111 1111 1111 1111 1111 1111 1111 1100 ->是负整数，要计算其补码 ->1 000 0000 0000 0000 0000 0000 0000 0100得补码 
//是什么位移取决于编译器，一般是算数位移 
	int h=g>>1; 
	
	printf("%d\n",h); 
	
	
	
	
	
	
	
	
	
	return 0; 
}
