#include<stdio.h>
// && 逻辑与  只要有一个为假就是假（0） ，两个为真就为真（1） 
// || 逻辑或  只要有一个为真就是真（1） ，两个为假就为假（0） 
int main()
{
	int b2=0;
	int a1=3;
	int a2=4;
	int b=a1 && a2;
	int c1=a1 || b2; 
	printf("%d %d\n",b,c1);
	
	int b1=0;
	int a=a1 && b1;
	int c2=b1 || b2;
	printf("%d %d\n",a,c2);
	
//	int i=0, a0=0, b0=2, c0=3, d0=4;
//	i= a0++ && ++b0 && d0++;
	// 0(刚进入)->计算完1  && 3(计算后) && 5(计算后) 
	//在i这里从左往右开始，a0++刚进入是0，计算完a0++,后面的计算就不用进行了，已经判断为假了 (只要有一个为假就是假（0）) 
//	printf("a=%d\nb=%d\nc=%d\nd=%d\n",a0,b0,c0,d0);

	

	
//	int y=0, a0=0, b0=2, c0=3, d0=4; //初始化 
	//将a0++放在中间 
//	y =	++b0 && a0++ && d0++;
    // 3(计算后) && 0(刚进入)->计算完1 && 5(计算后) 
    //计算完++b0后，a0++进入是0，算完a0++那d0++就不会继续计算 
//    printf("\na=%d\nb=%d\nc=%d\nd=%d\n",a0,b0,c0,d0);


//	int u=0, a0=0, b0=2, c0=3, d0=4; //初始化 
//	u= a0++ || ++b0 || d0++;
	// 0(刚进入)->计算为1 || 3(刚进入) || 5(计算后) 
	//a0++刚进入的时候是0为假，继续到++b0刚进入为真，就停止，计算完++b0就不计算后面的了 (只要有一个为真就是真（1）) 
//	printf("\na=%d\nb=%d\nc=%d\nd=%d",a0,b0,c0,d0);	
	
	
	int p=0, a0=1, b0=2, c0=3, d0=4;
	p= a0++ || ++b0 || d0++;
	//  1(刚进入)->计算完2 || 3(计算完) || 5(计算完) 
	//a0++刚进入的时候是1为真，计算完a0++就不计算后面了 
	printf("\na=%d\nb=%d\nc=%d\nd=%d",a0,b0,c0,d0);
	return 0;
}
