#include<stdio.h>
int main()
{
//	unsigned long p[]={6,7,8,9,10};
//	unsigned long *q;
//	q=p;  //传的是p的首地址 
//	*(q + 3) += 3;   //  &q[0+3] += 3
//	printf("%d ,%d\n",*q,*(q+3));
	
	
	
	
	
//数据在内存存放时是以十六位进制存放1 -> 0x 00 00 00 01	 2 -> 0x 00 00 00 02
//int类型单位是4个字节那么0x后面的8位存储的就是4个字节  ->    0x [] [] [] []
//在内存中                    低地址                	 --------------------->  高地址 
//int数据存储方向是倒序的     [01 00 00 00][02 00 00 00][03 00 00 00].....[44 33 22 11] 
//short*类型单位是2个字节如果int存储的是1，换为short存储是[01 00][00 00],也就是取出int类型的1(取出4个字节), 取出的short类型是1和0 
	int arr[]={1,2,3,4,5};
// [01 00 00 00] [02 00 00 00] [03 00 00 00] [04 00 00 00] [05 00 00 00]  
	short* p = (short*)arr;
//(short*)arr将int转化成short类型
// [01 00][00 00] [02 00][00 00] [03 00][00 00] [04 00][00 00] [05 00][00 00]
 
	int i=0;
	for(i=0;i<4;i++) //i=0,1,2,3
	{
		*(p+i)=0;   //i=0时 *p=short*arr[0]=1->0    i=1时 *(p+1)=short*arr[1]=0  i=2->2->0  i=3->0
	 } 
//原来的(short*)arr -> [00 00][00 00] [00 00][00 00] [03 00][00 00] [04 00][00 00] [05 00][00 00]
//转化为int arr     -> [00 00 00 00] [00 00 00 00] [03 00 00 00] [04 00 00 00] [05 00 00 00]  
	 for(i=0;i<5;i++)//  arr[0]=0      arr[1]=0       arr[2]=3     arr[3]=4
	 {
	 	printf("%d ",arr[i]);
	 }
	 printf("\n");


	int a=0x11223344;
//在内存中            低地址         --------------------->  高地址 
//int在内存中         [44 33 22 11] 
	char* pc = (char*)&a;  //[44 33] [22 11]
	*pc =0;                //首地址变为0 -> [00 33] [22 11] 
	printf("%x\n",a);     //%x 输出十六进制的数  int a =0x11223300

	 
	return 0;
}
